backend: tensorflow
class_name: Model
config:
  input_layers:
  - [input_1, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 25]
      dtype: float32
      name: input_1
      sparse: false
    inbound_nodes: []
    name: input_1
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {dtype: float32}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, dtype: float32, mode: fan_avg, scale: 1.0,
          seed: null}
      kernel_regularizer: null
      name: dense
      trainable: true
      units: 128
      use_bias: true
    inbound_nodes:
    - - - input_1
        - 0
        - 0
        - {}
    name: dense
  - class_name: Dropout
    config: {dtype: float32, name: dropout, noise_shape: null, rate: 0.5, seed: null,
      trainable: true}
    inbound_nodes:
    - - - dense
        - 0
        - 0
        - {}
    name: dropout
  - class_name: BatchNormalization
    config:
      axis: [1]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {dtype: float32}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {dtype: float32}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {dtype: float32}
      moving_variance_initializer:
        class_name: Ones
        config: {dtype: float32}
      name: batch_normalization
      scale: true
      trainable: true
    inbound_nodes:
    - - - dropout
        - 0
        - 0
        - {}
    name: batch_normalization
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {dtype: float32}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, dtype: float32, mode: fan_avg, scale: 1.0,
          seed: null}
      kernel_regularizer: null
      name: dense_1
      trainable: true
      units: 128
      use_bias: true
    inbound_nodes:
    - - - batch_normalization
        - 0
        - 0
        - {}
    name: dense_1
  - class_name: Dropout
    config: {dtype: float32, name: dropout_1, noise_shape: null, rate: 0.5, seed: null,
      trainable: true}
    inbound_nodes:
    - - - dense_1
        - 0
        - 0
        - {}
    name: dropout_1
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {dtype: float32}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, dtype: float32, mode: fan_avg, scale: 1.0,
          seed: null}
      kernel_regularizer: null
      name: dense_2
      trainable: true
      units: 128
      use_bias: true
    inbound_nodes:
    - - - dropout_1
        - 0
        - 0
        - {}
    name: dense_2
  - class_name: Dropout
    config: {dtype: float32, name: dropout_2, noise_shape: null, rate: 0.5, seed: null,
      trainable: true}
    inbound_nodes:
    - - - dense_2
        - 0
        - 0
        - {}
    name: dropout_2
  - class_name: BatchNormalization
    config:
      axis: [1]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {dtype: float32}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {dtype: float32}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {dtype: float32}
      moving_variance_initializer:
        class_name: Ones
        config: {dtype: float32}
      name: batch_normalization_1
      scale: true
      trainable: true
    inbound_nodes:
    - - - dropout_2
        - 0
        - 0
        - {}
    name: batch_normalization_1
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {dtype: float32}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, dtype: float32, mode: fan_avg, scale: 1.0,
          seed: null}
      kernel_regularizer: null
      name: dense_3
      trainable: true
      units: 128
      use_bias: true
    inbound_nodes:
    - - - batch_normalization_1
        - 0
        - 0
        - {}
    name: dense_3
  - class_name: Dropout
    config: {dtype: float32, name: dropout_3, noise_shape: null, rate: 0.5, seed: null,
      trainable: true}
    inbound_nodes:
    - - - dense_3
        - 0
        - 0
        - {}
    name: dropout_3
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {dtype: float32}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, dtype: float32, mode: fan_avg, scale: 1.0,
          seed: null}
      kernel_regularizer: null
      name: dense_4
      trainable: true
      units: 128
      use_bias: true
    inbound_nodes:
    - - - dropout_3
        - 0
        - 0
        - {}
    name: dense_4
  - class_name: Dropout
    config: {dtype: float32, name: dropout_4, noise_shape: null, rate: 0.5, seed: null,
      trainable: true}
    inbound_nodes:
    - - - dense_4
        - 0
        - 0
        - {}
    name: dropout_4
  - class_name: BatchNormalization
    config:
      axis: [1]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {dtype: float32}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {dtype: float32}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {dtype: float32}
      moving_variance_initializer:
        class_name: Ones
        config: {dtype: float32}
      name: batch_normalization_2
      scale: true
      trainable: true
    inbound_nodes:
    - - - dropout_4
        - 0
        - 0
        - {}
    name: batch_normalization_2
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {dtype: float32}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, dtype: float32, mode: fan_avg, scale: 1.0,
          seed: null}
      kernel_regularizer: null
      name: dense_5
      trainable: true
      units: 128
      use_bias: true
    inbound_nodes:
    - - - batch_normalization_2
        - 0
        - 0
        - {}
    name: dense_5
  - class_name: Dropout
    config: {dtype: float32, name: dropout_5, noise_shape: null, rate: 0.5, seed: null,
      trainable: true}
    inbound_nodes:
    - - - dense_5
        - 0
        - 0
        - {}
    name: dropout_5
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {dtype: float32}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, dtype: float32, mode: fan_avg, scale: 1.0,
          seed: null}
      kernel_regularizer: null
      name: dense_6
      trainable: true
      units: 128
      use_bias: true
    inbound_nodes:
    - - - dropout_5
        - 0
        - 0
        - {}
    name: dense_6
  - class_name: Dropout
    config: {dtype: float32, name: dropout_6, noise_shape: null, rate: 0.5, seed: null,
      trainable: true}
    inbound_nodes:
    - - - dense_6
        - 0
        - 0
        - {}
    name: dropout_6
  - class_name: BatchNormalization
    config:
      axis: [1]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {dtype: float32}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {dtype: float32}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {dtype: float32}
      moving_variance_initializer:
        class_name: Ones
        config: {dtype: float32}
      name: batch_normalization_3
      scale: true
      trainable: true
    inbound_nodes:
    - - - dropout_6
        - 0
        - 0
        - {}
    name: batch_normalization_3
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {dtype: float32}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, dtype: float32, mode: fan_avg, scale: 1.0,
          seed: null}
      kernel_regularizer: null
      name: dense_7
      trainable: true
      units: 128
      use_bias: true
    inbound_nodes:
    - - - batch_normalization_3
        - 0
        - 0
        - {}
    name: dense_7
  - class_name: Dropout
    config: {dtype: float32, name: dropout_7, noise_shape: null, rate: 0.5, seed: null,
      trainable: true}
    inbound_nodes:
    - - - dense_7
        - 0
        - 0
        - {}
    name: dropout_7
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {dtype: float32}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, dtype: float32, mode: fan_avg, scale: 1.0,
          seed: null}
      kernel_regularizer: null
      name: dense_8
      trainable: true
      units: 128
      use_bias: true
    inbound_nodes:
    - - - dropout_7
        - 0
        - 0
        - {}
    name: dense_8
  - class_name: Dropout
    config: {dtype: float32, name: dropout_8, noise_shape: null, rate: 0.5, seed: null,
      trainable: true}
    inbound_nodes:
    - - - dense_8
        - 0
        - 0
        - {}
    name: dropout_8
  - class_name: BatchNormalization
    config:
      axis: [1]
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {dtype: float32}
      beta_regularizer: null
      center: true
      dtype: float32
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {dtype: float32}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {dtype: float32}
      moving_variance_initializer:
        class_name: Ones
        config: {dtype: float32}
      name: batch_normalization_4
      scale: true
      trainable: true
    inbound_nodes:
    - - - dropout_8
        - 0
        - 0
        - {}
    name: batch_normalization_4
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {dtype: float32}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, dtype: float32, mode: fan_avg, scale: 1.0,
          seed: null}
      kernel_regularizer: null
      name: dense_9
      trainable: true
      units: 128
      use_bias: true
    inbound_nodes:
    - - - batch_normalization_4
        - 0
        - 0
        - {}
    name: dense_9
  - class_name: Dropout
    config: {dtype: float32, name: dropout_9, noise_shape: null, rate: 0.5, seed: null,
      trainable: true}
    inbound_nodes:
    - - - dense_9
        - 0
        - 0
        - {}
    name: dropout_9
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {dtype: float32}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, dtype: float32, mode: fan_avg, scale: 1.0,
          seed: null}
      kernel_regularizer: null
      name: dense_10
      trainable: true
      units: 128
      use_bias: true
    inbound_nodes:
    - - - dropout_9
        - 0
        - 0
        - {}
    name: dense_10
  - class_name: Dropout
    config: {dtype: float32, name: dropout_10, noise_shape: null, rate: 0.5, seed: null,
      trainable: true}
    inbound_nodes:
    - - - dense_10
        - 0
        - 0
        - {}
    name: dropout_10
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {dtype: float32}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, dtype: float32, mode: fan_avg, scale: 1.0,
          seed: null}
      kernel_regularizer: null
      name: dense_11
      trainable: true
      units: 1
      use_bias: true
    inbound_nodes:
    - - - dropout_10
        - 0
        - 0
        - {}
    name: dense_11
  name: model
  output_layers:
  - [dense_11, 0, 0]
keras_version: 2.1.6-tf
